# Project 1: Explanatory Data Analysis & Data Presentation (Movies Dataset)

# Project Brief for Self-Coders

Here you´ll have the opportunity to code major parts of Project 1 on your own. If you need any help or inspiration, have a look at the Videos or the Jupyter Notebook with the full code. <br> <br>
Keep in mind that it´s all about __getting the right results/conclusions__. It´s not about finding the identical code. Things can be coded in many different ways. Even if you come to the same conclusions, it´s very unlikely that we have the very same code.

## Data Import and first Inspection

1. __Import__ the movies dataset from the CSV file "movies_complete.csv". __Inspect__ the data.

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
pd.options.display.max_columns = 30
pd.options.display.float_format = '{:.2f}'.format

df = pd.read_csv("movies_complete.csv", parse_dates=["release_date"])

__Some additional information on Features/Columns__:

* **id:** The ID of the movie (clear/unique identifier).
* **title:** The Official Title of the movie.
* **tagline:** The tagline of the movie.
* **release_date:** Theatrical Release Date of the movie.
* **genres:** Genres associated with the movie.
* **belongs_to_collection:** Gives information on the movie series/franchise the particular film belongs to.
* **original_language:** The language in which the movie was originally shot in.
* **budget_musd:** The budget of the movie in million dollars.
* **revenue_musd:** The total revenue of the movie in million dollars.
* **production_companies:** Production companies involved with the making of the movie.
* **production_countries:** Countries where the movie was shot/produced in.
* **vote_count:** The number of votes by users, as counted by TMDB.
* **vote_average:** The average rating of the movie.
* **popularity:** The Popularity Score assigned by TMDB.
* **runtime:** The runtime of the movie in minutes.
* **overview:** A brief blurb of the movie.
* **spoken_languages:** Spoken languages in the film.
* **poster_path:** The URL of the poster image.
* **cast:** (Main) Actors appearing in the movie.
* **cast_size:** number of Actors appearing in the movie.
* **director:** Director of the movie.
* **crew_size:** Size of the film crew (incl. director, excl. actors).

In [2]:
df.describe(include= 'object')

,title,tagline,genres,belongs_to_collection,original_language,production_companies,production_countries,overview,spoken_languages,poster_path,cast,director
count,44691,20284,42586,4463,44681,33356,38835,43740,41094,44467,42502,43960
unique,41605,20171,4044,1691,89,22537,2377,43715,1828,44456,42166,17349
top,Cinderella,Based on a true story.,Drama,The Bowery Boys,en,Metro-Goldwyn-Mayer (MGM),United States of America,Adaptation of the Jane Austen novel.,English,<img src='http://image.tmdb.org/t/p/w185//qW1o...,Georges Méliès,John Ford
freq,11,7,4935,29,31755,741,17723,3,22189,3,24,66

## The best and the worst movies...

2. __Filter__ the Dataset and __find the best/worst n Movies__ with the

- Highest Revenue
- Highest Budget
- Highest Profit (=Revenue - Budget)
- Lowest Profit (=Revenue - Budget)
- Highest Return on Investment (=Revenue / Budget) (only movies with Budget >= 10) 
- Lowest Return on Investment (=Revenue / Budget) (only movies with Budget >= 10)
- Highest number of Votes
- Highest Rating (only movies with 10 or more Ratings)
- Lowest Rating (only movies with 10 or more Ratings)
- Highest Popularity

__Define__ an appropriate __user-defined function__ to reuse code.

In [4]:
# data set have column that containt HTML elements
# import IPython module that can display those HTML elements in dataframe
from IPython.display import HTML

In [5]:
# create df_best, sub datafram from df
# df_best is going to be use for best/worst measurement 
df_best = df[['poster_path', 'title', 'budget_musd', 'revenue_musd', 'vote_count', 
             'vote_average', 'popularity']].copy()

# profit column = revenue - budget
df_best['profit_musd'] = df_best.revenue_musd.sub(df_best.budget_musd)

# rate of ROI = revenue / budget
df_best['ROI'] = df_best.revenue_musd.div(df_best.budget_musd)

In [6]:
df_best.columns = ['Poster', 'Title', 'Budget',
                  'Revenue', 'Votes', 'Average Rating', 'Popularity', 'Profit', 'ROI']
df_best.set_index("Title", inplace=True)
df_best

,Poster,Budget,Revenue,Votes,Average Rating,Popularity,Profit,ROI
Title,,,,,,,,
Toy Story,<img src='http://image.tmdb.org/t/p/w185//uXDf...,30.00,373.55,5415.00,7.70,21.95,343.55,12.45
Jumanji,<img src='http://image.tmdb.org/t/p/w185//vgpX...,65.00,262.80,2413.00,6.90,17.02,197.80,4.04
Grumpier Old Men,<img src='http://image.tmdb.org/t/p/w185//1FSX...,NaN,NaN,92.00,6.50,11.71,NaN,NaN
Waiting to Exhale,<img src='http://image.tmdb.org/t/p/w185//4wjG...,16.00,81.45,34.00,6.10,3.86,65.45,5.09
Father of the Bride Part II,<img src='http://image.tmdb.org/t/p/w185//lf9R...,NaN,76.58,173.00,5.70,8.39,NaN,NaN
...,...,...,...,...,...,...,...,...
Subdue,<img src='http://image.tmdb.org/t/p/w185//pfC8...,NaN,NaN,1.00,4.00,0.07,NaN,NaN
Century of Birthing,<img src='http://image.tmdb.org/t/p/w185//xZkm...,NaN,NaN,3.00,9.00,0.18,NaN,NaN
Betrayal,<img src='http://image.tmdb.org/t/p/w185//eGga...,NaN,NaN,6.00,3.80,0.90,NaN,NaN
Satan Triumphant,<img src='http://image.tmdb.org/t/p/w185//aorB...,NaN,NaN,0.00,NaN,0.00,NaN,NaN
Queerama,<img src='http://image.tmdb.org/t/p/w185//oxFE...,NaN,NaN,0.00,NaN,0.16,NaN,NaN

In [7]:
# DO NOT RUN THIS, RAM EATING
# HTML(df_best.to_html(escape=False))

# use HTML module to display HTML elements inside the dataframe
# .to_html convert the data.farame into html code
subset = df_best.iloc[:3,:2]
HTML(subset.to_html(escape=False))

In [8]:
# to start ranking movie, we need metric: budget, votes...
# those columns has null value--> fill in with 0
df_best.Budget.fillna(0, inplace=True)
df_best.Votes.fillna(0, inplace=True)
df_best.info()

<class 'pandas.core.frame.DataFrame'>
Index: 44691 entries, Toy Story to Queerama
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Poster          44467 non-null  object
 1   Budget          44691 non-null  float64
 2   Revenue         7385 non-null   float64
 3   Votes           44691 non-null  float64
 4   Average Rating  42077 non-null  float64
 5   Popularity      44691 non-null  float64
 6   Profit          5371 non-null   float64
 7   ROI             5371 non-null   float64
dtypes: float64(7), object(1)
memory usage: 3.1+ MB

In [9]:
# DEFINE FUNCTION for making rankings

# parameters:
# n : number of ranks (top5, top 10, top 3, ...)
# ascending: order
# min_bud: minimum budget for the comparison
# min_votes: minimum votes

def best_worst (n , by, ascending=False, min_bud = 0, min_votes=0):
    
     df2 = df_best.loc[(df_best.Budget >= min_bud) & (df_best.Votes >= min_votes), 
                      ["Poster", by]].sort_values(by = by, ascending = ascending).head(n).copy()
        
     return HTML(df2.to_html(escape=False))

In [10]:
# df.loc[(df_best.Budget >= 5) & (df_best.Votes >= 10), ["", "Revenue"]].sort_values(by = "Revenue")

__Movies Top 5 - Highest Revenue__

In [11]:
best_worst(n = 5, by = "Revenue")

__Movies Top 5 - Highest Budget__

In [12]:
best_worst(5, by="Budget")

__Movies Top 5 - Highest Profit__

In [13]:
best_worst(5, by="Profit")

__Movies Top 5 - Lowest Profit__

In [14]:
best_worst(5, by="Profit", ascending=True)

__Movies Top 5 - Highest ROI__

In [15]:
best_worst(5, by="ROI")

__Movies Top 5 - Lowest ROI__

In [16]:
best_worst(5, by="ROI", ascending=True)

__Movies Top 5 - Most Votes__

In [23]:
best_worst(5, by="Votes")

__Movies Top 5 - Highest Rating__

In [24]:
best_worst(5, by="Average Rating")

__Movies Top 5 - Lowest Rating__

In [25]:
best_worst(5, by="Average Rating", ascending=True)

__Movies Top 5 - Most Popular__

In [26]:
best_worst(5, by="Popularity")

## Find your next Movie

3. __Filter__ the Dataset for movies that meet the following conditions:

__Search 1: Science Fiction Action Movie with Bruce Willis (sorted from high to low Rating)__

__Search 2: Movies with Uma Thurman and directed by Quentin Tarantino (sorted from short to long runtime)__

__Search 3: Most Successful Pixar Studio Movies between 2010 and 2015 (sorted from high to low Revenue)__

__Search 4: Action or Thriller Movie with original language English and minimum Rating of 7.5 (most recent movies first)__

In [48]:
# create a panda series that contain satisfy condition: genres of Action and Science Fiction
marked_genres = df.genres.str.contains("Action") & df.genres.str.contains("Science Fiction")

# create a panda series that contain satisfy condition: movie that have Bruce Willis in casts
marked_actor = df.cast.str.contains("Bruce Willis")

In [51]:
bw_movies = df.loc[marked_actor & marked_genres, 
                   ['title', 'vote_average', 'poster_path']].sort_values(by='vote_average', ascending = False)
HTML(bw_movies.to_html(escape=False))

## Are Franchises more successful?

4. __Analyze__ the Dataset and __find out whether Franchises (Movies that belong to a collection) are more successful than stand-alone movies__ in terms of:

- mean revenue
- median Return on Investment
- mean budget raised
- mean popularity
- mean rating

hint: use groupby()

__Franchise vs. Stand-alone: Average Revenue__

In [17]:
df

,id,title,tagline,release_date,genres,belongs_to_collection,original_language,budget_musd,revenue_musd,production_companies,production_countries,vote_count,vote_average,popularity,runtime,overview,spoken_languages,poster_path,cast,cast_size,crew_size,director
0,862,Toy Story,NaN,1995-10-30,Animation|Comedy|Family,Toy Story Collection,en,30.00,373.55,Pixar Animation Studios,United States of America,5415.00,7.70,21.95,81.00,"Led by Woody, Andy's toys live happily in his ...",English,<img src='http://image.tmdb.org/t/p/w185//uXDf...,Tom Hanks|Tim Allen|Don Rickles|Jim Varney|Wal...,13,106,John Lasseter
1,8844,Jumanji,Roll the dice and unleash the excitement!,1995-12-15,Adventure|Fantasy|Family,NaN,en,65.00,262.80,TriStar Pictures|Teitler Film|Interscope Commu...,United States of America,2413.00,6.90,17.02,104.00,When siblings Judy and Peter discover an encha...,English|Français,<img src='http://image.tmdb.org/t/p/w185//vgpX...,Robin Williams|Jonathan Hyde|Kirsten Dunst|Bra...,26,16,Joe Johnston
2,15602,Grumpier Old Men,Still Yelling. Still Fighting. Still Ready for...,1995-12-22,Romance|Comedy,Grumpy Old Men Collection,en,NaN,NaN,Warner Bros.|Lancaster Gate,United States of America,92.00,6.50,11.71,101.00,A family wedding reignites the ancient feud be...,English,<img src='http://image.tmdb.org/t/p/w185//1FSX...,Walter Matthau|Jack Lemmon|Ann-Margret|Sophia ...,7,4,Howard Deutch
3,31357,Waiting to Exhale,Friends are the people who let you be yourself...,1995-12-22,Comedy|Drama|Romance,NaN,en,16.00,81.45,Twentieth Century Fox Film Corporation,United States of America,34.00,6.10,3.86,127.00,"Cheated on, mistreated and stepped on, the wom...",English,<img src='http://image.tmdb.org/t/p/w185//4wjG...,Whitney Houston|Angela Bassett|Loretta Devine|...,10,10,Forest Whitaker
4,11862,Father of the Bride Part II,Just When His World Is Back To Normal... He's ...,1995-02-10,Comedy,Father of the Bride Collection,en,NaN,76.58,Sandollar Productions|Touchstone Pictures,United States of America,173.00,5.70,8.39,106.00,Just when George Banks has recovered from his ...,English,<img src='http://image.tmdb.org/t/p/w185//lf9R...,Steve Martin|Diane Keaton|Martin Short|Kimberl...,12,7,Charles Shyer
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
44686,439050,Subdue,Rising and falling between a man and woman,NaT,Drama|Family,NaN,fa,NaN,NaN,NaN,Iran,1.00,4.00,0.07,90.00,Rising and falling between a man and woman.,فارسی,<img src='http://image.tmdb.org/t/p/w185//pfC8...,Leila Hatami|Kourosh Tahami|Elham Korda,3,9,Hamid Nematollah
44687,111109,Century of Birthing,NaN,2011-11-17,Drama,NaN,tl,NaN,NaN,Sine Olivia,Philippines,3.00,9.00,0.18,360.00,An artist struggles to finish his work while a...,NaN,<img src='http://image.tmdb.org/t/p/w185//xZkm...,Angel Aquino|Perry Dizon|Hazel Orencio|Joel To...,11,6,Lav Diaz
44688,67758,Betrayal,A deadly game of wits.,2003-08-01,Action|Drama|Thriller,NaN,en,NaN,NaN,American World Pictures,United States of America,6.00,3.80,0.90,90.00,"When one of her hits goes wrong, a professiona...",English,<img src='http://image.tmdb.org/t/p/w185//eGga...,Erika Eleniak|Adam Baldwin|Julie du Page|James...,15,5,Mark L. Lester
44689,227506,Satan Triumphant,NaN,1917-10-21,NaN,NaN,en,NaN,NaN,Yermoliev,Russia,0.00,NaN,0.00,87.00,"In a small town live two brothers, one a minis...",NaN,<img src='http://image.tmdb.org/t/p/w185//aorB...,Iwan Mosschuchin|Nathalie Lissenko|Pavel Pavlo...,5,2,Yakov Protazanov
44690,461257,Queerama,NaN,2017-06-09,NaN,NaN,en,NaN,NaN,NaN,United Kingdom,0.00,NaN,0.16,75.00,50 years after decriminalisation of homosexual...,English,<img src='http://image.tmdb.org/t/p/w185//oxFE...,NaN,0,1,Daisy Asquith

In [21]:
df['franchise'] = df.belongs_to_collection.notna()
df.franchise.value_counts()

False    40228
True      4463
Name: franchise, dtype: int64

In [22]:
# groupby franchise, get average revenue of each group
df.groupby('franchise').revenue_musd.mean()

# based on this info:
# Movies that associates with franchise have higher avg. revenue

franchise
False    44.74
True    165.71
Name: revenue_musd, dtype: float64

__Franchise vs. Stand-alone: Return on Investment / Profitability (median)__

In [26]:
df['Profit'] = df.revenue_musd-df.budget_musd
df['ROI'] = df.revenue_musd/df.budget_musd
df.groupby('franchise').ROI.median()

# Franchise has higher median than stand-alone

franchise
False   1.62
True    3.71
Name: ROI, dtype: float64

__Franchise vs. Stand-alone: Average Budget__

In [27]:
df.groupby('franchise').budget_musd.mean()

# Franchise has higher budget than standalone

franchise
False   18.05
True    38.32
Name: budget_musd, dtype: float64

__Franchise vs. Stand-alone: Average Popularity__

In [29]:
df.groupby('franchise').popularity.mean()

# Franchises are more popular than standalone

franchise
False   2.59
True    6.25
Name: popularity, dtype: float64

__Franchise vs. Stand-alone: Average Rating__

In [31]:
df.groupby('franchise').vote_average.mean()

# Standalone has better rating
# this is the only categories that franchise lose again standalone

franchise
False   6.01
True    5.96
Name: vote_average, dtype: float64

## Most Successful Franchises

5. __Find__ the __most successful Franchises__ in terms of

- __total number of movies__
- __total & mean budget__
- __total & mean revenue__
- __mean rating__

In [46]:
# create a subset that only have movies that associate with franchises
franchise_df = df[['title', 'revenue_musd', 'budget_musd', 'vote_average', 
                   'belongs_to_collection', 'franchise']].copy()
franchise_df = franchise_df.loc[franchise_df['franchise'] == True]
franchise_df

,title,revenue_musd,budget_musd,vote_average,belongs_to_collection,franchise
0,Toy Story,373.55,30.00,7.70,Toy Story Collection,True
2,Grumpier Old Men,NaN,NaN,6.50,Grumpy Old Men Collection,True
4,Father of the Bride Part II,76.58,NaN,5.70,Father of the Bride Collection,True
9,GoldenEye,352.19,58.00,6.60,James Bond Collection,True
12,Balto,11.35,NaN,7.10,Balto Collection,True
...,...,...,...,...,...,...
44582,Carry On Follow That Camel,NaN,NaN,6.10,The Carry On Collection,True
44585,Carry On Camping,NaN,NaN,6.50,The Carry On Collection,True
44596,Carry On England,NaN,NaN,4.80,The Carry On Collection,True
44598,LEGO DC Super Hero Girls: Brain Drain,NaN,NaN,10.00,DC Super Hero Girls Collection,True
44609,The Twin Swords,NaN,NaN,5.60,Red Lotus Collection,True

In [57]:
franshise_stat_df = franchise_df.groupby('belongs_to_collection').agg({'title':'count', 
                                                   'budget_musd': ['sum', 'mean'],
                                                    'revenue_musd': ['sum', 'mean'],
                                                  'vote_average': ['mean']})
franshise_stat_df

                                     title budget_musd       revenue_musd  \
                                     count         sum  mean          sum
belongs_to_collection
... Has Fallen Collection                2      130.00 65.00       366.78
00 Schneider Filmreihe                   1        0.00   NaN         0.00
08/15 Collection                         1        0.00   NaN         0.00
100 Girls Collection                     2        0.00   NaN         0.00
101 Dalmatians (Animated) Collection     2        4.00  4.00       215.88
...                                    ...         ...   ...          ...
Сказки Чуковского                        1        0.00   NaN         0.00
Чебурашка и крокодил Гена                1        0.00   NaN         0.00
Что Творят мужчины! (Коллекция)          2        2.00  2.00         0.00
男はつらいよ シリーズ                              3        0.00   NaN         0.00
식객 시리즈                                   2        0.00   NaN         0.00

                                            vote_average
                                       mean         mean
belongs_to_collection
... Has Fallen Collection            183.39         6.00
00 Schneider Filmreihe                  NaN         6.50
08/15 Collection                        NaN         5.90
100 Girls Collection                    NaN         5.15
101 Dalmatians (Animated) Collection 215.88         6.25
...                                     ...          ...
Сказки Чуковского                       NaN         3.00
Чебурашка и крокодил Гена               NaN         6.70
Что Творят мужчины! (Коллекция)         NaN         3.15
男はつらいよ シリーズ                             NaN         7.00
식객 시리즈                                  NaN         4.95

[1691 rows x 6 columns]

In [58]:
# top 10 franchises by title count
franshise_stat_df.nlargest(10, ('title', 'count'))

                                       title budget_musd       revenue_musd  \
                                       count         sum  mean          sum
belongs_to_collection
The Bowery Boys                           29        0.00   NaN         0.00
Totò Collection                           27        0.00   NaN         0.00
James Bond Collection                     26     1539.65 59.22      7106.97
Zatôichi: The Blind Swordsman             26        0.00   NaN         0.00
The Carry On Collection                   25        0.00   NaN         0.00
Charlie Chan (Sidney Toler) Collection    21        0.00   NaN         0.00
Pokémon Collection                        20      250.72 50.14       601.87
Godzilla (Showa) Collection               16        2.81  0.56         0.00
Charlie Chan (Warner Oland) Collection    15        0.00   NaN         0.00
Dragon Ball Z (Movie) Collection          15        5.00  5.00       112.12

                                              vote_average
                                         mean         mean
belongs_to_collection
The Bowery Boys                           NaN         6.67
Totò Collection                           NaN         6.84
James Bond Collection                  273.35         6.34
Zatôichi: The Blind Swordsman             NaN         6.40
The Carry On Collection                   NaN         6.17
Charlie Chan (Sidney Toler) Collection    NaN         6.61
Pokémon Collection                      66.87         6.05
Godzilla (Showa) Collection               NaN         5.97
Charlie Chan (Warner Oland) Collection    NaN         6.66
Dragon Ball Z (Movie) Collection        56.06         6.61

In [61]:
# top 10 franchise by budget
franshise_stat_df.nlargest(10, ('budget_musd', 'sum'))

# by average budget
# franshise_stat_df.nlargest(10, ('budget_musd', 'mean'))

                                    title budget_musd        revenue_musd  \
                                    count         sum   mean          sum
belongs_to_collection
Tangled Collection                      2      260.00 260.00       591.79
Pirates of the Caribbean Collection     5     1250.00 250.00      4521.58
The Avengers Collection                 2      500.00 250.00      2924.96
The Hobbit Collection                   3      750.00 250.00      2935.52
Man of Steel Collection                 2      475.00 237.50      1536.11
Avatar Collection                       1      237.00 237.00      2787.97
The Amazing Spider-Man Collection       2      415.00 207.50      1457.93
World War Z Collection                  1      200.00 200.00       531.87
Spider-Man Collection                   3      597.00 199.00      2496.35
The Dark Knight Collection              3      585.00 195.00      2463.72

                                            vote_average
                                       mean         mean
belongs_to_collection
Tangled Collection                   591.79         7.25
Pirates of the Caribbean Collection  904.32         6.88
The Avengers Collection             1462.48         7.35
The Hobbit Collection                978.51         7.23
Man of Steel Collection              768.05         6.10
Avatar Collection                   2787.97         7.20
The Amazing Spider-Man Collection    728.97         6.50
World War Z Collection               531.87         6.70
Spider-Man Collection                832.12         6.47
The Dark Knight Collection           821.24         7.80

In [62]:
# top 10 franchise by revenue
franshise_stat_df.nlargest(10, ('revenue_musd', 'sum'))

# by average revenue
# franshise_stat_df.nlargest(10, ('revenue_musd', 'mean'))

                                    title budget_musd        revenue_musd  \
                                    count         sum   mean          sum
belongs_to_collection
Harry Potter Collection                 8     1280.00 160.00      7707.37
Star Wars Collection                    8      854.35 106.79      7434.49
James Bond Collection                  26     1539.65  59.22      7106.97
The Fast and the Furious Collection     8     1009.00 126.12      5125.10
Pirates of the Caribbean Collection     5     1250.00 250.00      4521.58
Transformers Collection                 5      965.00 193.00      4366.10
Despicable Me Collection                6      299.00  74.75      3691.07
The Twilight Collection                 5      385.00  77.00      3342.11
Ice Age Collection                      5      429.00  85.80      3216.71
Jurassic Park Collection                4      379.00  94.75      3031.48

                                           vote_average
                                      mean         mean
belongs_to_collection
Harry Potter Collection             963.42         7.54
Star Wars Collection                929.31         7.38
James Bond Collection               273.35         6.34
The Fast and the Furious Collection 640.64         6.66
Pirates of the Caribbean Collection 904.32         6.88
Transformers Collection             873.22         6.14
Despicable Me Collection            922.77         6.78
The Twilight Collection             668.42         5.84
Ice Age Collection                  643.34         6.38
Jurassic Park Collection            757.87         6.50

In [63]:
# top 10 franchise by average rating
franshise_stat_df.nlargest(10, ('vote_average', 'mean'))

                                    title budget_musd      revenue_musd       \
                                    count         sum mean          sum mean
belongs_to_collection
Argo Collection                         1        0.00  NaN         0.00  NaN
Bloodfight                              1        0.00  NaN         0.00  NaN
Dreileben                               1        0.00  NaN         0.00  NaN
Kenji Misumi's Trilogy of the Sword     1        0.00  NaN         0.00  NaN
Алиса в стране чудес (Коллекция)        1        0.00  NaN         0.00  NaN
We Were Here                            2        0.00  NaN         0.00  NaN
Kizumonogatari                          3        0.00  NaN         0.00  NaN
Glass Tiger collection                  1        0.00  NaN         0.00  NaN
OSS 117 The Original Saga               1        0.00  NaN         0.00  NaN
Spirits' Homecoming Collection          1        0.00  NaN         0.00  NaN

                                    vote_average
                                            mean
belongs_to_collection
Argo Collection                             9.30
Bloodfight                                  9.00
Dreileben                                   9.00
Kenji Misumi's Trilogy of the Sword         9.00
Алиса в стране чудес (Коллекция)            8.70
We Were Here                                8.65
Kizumonogatari                              8.63
Glass Tiger collection                      8.50
OSS 117 The Original Saga                   8.50
Spirits' Homecoming Collection              8.50

## Most Successful Directors

6. __Find__ the __most successful Directors__ in terms of

- __total number of movies__
- __total revenue__
- __mean rating__

In [6]:
df.columns

Index(['id', 'title', 'tagline', 'release_date', 'genres',
       'belongs_to_collection', 'original_language', 'budget_musd',
       'revenue_musd', 'production_companies', 'production_countries',
       'vote_count', 'vote_average', 'popularity', 'runtime', 'overview',
       'spoken_languages', 'poster_path', 'cast', 'cast_size', 'crew_size',
       'director'],
      dtype='object')

In [8]:
directors_df = df.groupby('director').agg({'title':'count',
                                         'revenue_musd': 'sum',
                                         'vote_average':'mean'})
directors_df

                     title  revenue_musd  vote_average
director
 Dale Trevillion\t       2          0.00          4.00
 Davide Manuli           1          0.00          6.90
 E.W. Swackhamer         1          0.00          5.90
 Vitaliy Vorobyov        1          0.00          5.50
 Yeon Sang-Ho            4          2.13          6.60
...                    ...           ...           ...
Ярополк Лапшин           1          0.00         10.00
پیمان معادی              1          0.00          6.00
塩谷 直義                    1          0.00          7.20
杰森·莫玛                    1          0.00          5.80
진모영                      1          0.00          6.00

[17349 rows x 3 columns]

In [15]:
# top 10 directors that have the most titles under their names
directors_df.nlargest(10, ('title'))

# NOTES: the 'columns' parameter in nlarget() function in this case doesn't request 'title', 'count'
# the header of dataframe in this analysis is are not series within series, they are series of single element
# if use 'title','count' it would give out 'KeyError'

                  title  revenue_musd  vote_average
director
John Ford            66         85.17          6.38
Michael Curtiz       65         37.82          6.00
Werner Herzog        54         24.57          6.81
Alfred Hitchcock     53        250.11          6.64
Georges Méliès       49          0.00          5.93
Woody Allen          49        993.97          6.69
Jean-Luc Godard      46          0.87          6.80
Sidney Lumet         46        294.52          6.58
Charlie Chaplin      44         26.52          6.54
Raoul Walsh          43          1.21          6.00

In [16]:
# top 10 directors get the most revenue from their movie titles
directors_df.nlargest(10, ('revenue_musd'))

                   title  revenue_musd  vote_average
director
Steven Spielberg      33       9256.62          6.89
Peter Jackson         13       6528.24          7.14
Michael Bay           13       6437.47          6.39
James Cameron         11       5900.61          6.93
David Yates            9       5334.56          6.70
Christopher Nolan     11       4747.41          7.62
Robert Zemeckis       19       4138.23          6.79
Tim Burton            21       4032.92          6.73
Ridley Scott          24       3917.53          6.60
Chris Columbus        15       3866.84          6.44

In [18]:
# top 20 directors that have highest average rating of their movies 
directors_df.nlargest(20, ('vote_average'))

                      title  revenue_musd  vote_average
director
A.W. Vidmer               1          0.00         10.00
Amy Schatz                1          0.00         10.00
Ana Poliak                1          0.00         10.00
Andrew Bowser             1          0.00         10.00
Andrew Napier             1          0.00         10.00
Antonis Sotiropoulos      1          0.00         10.00
Barry Bruce               1          0.00         10.00
Brandon Chesbro           1          0.00         10.00
Brett M. Butler           1          0.00         10.00
Brian Skeet               1          0.00         10.00
Bruno Irizarry            1          0.00         10.00
Christine Edzard          1          0.00         10.00
Christopher Fraser        1          0.00         10.00
Cody Blue Snider          1          0.00         10.00
Colin Webb                1          0.00         10.00
Dan Hartley               1          0.00         10.00
David Langlitz            1          0.00         10.00
Deborah Koons             1          0.00         10.00
Dick Bartlett             1          0.00         10.00
Don Askarian              1          0.00         10.00